#include <stdio.h>
#include <stdlib.h>
#include <time.h> 
#include <windows.h> // 콘솔 수정용 헤더
#include <conio.h> // getch 와 kbhit 사용
#include <mmsystem.h> //사운드 함수
#include <stdio.h> 
#include <string.h> 


//상수 선언하기
#define UP 1
#define DOWN 2
#define LEFT 3
#define RIGHT 4
#define SUBMIT 5
#define ESC 6
#define LENGTH  10 
#define MAX_INPUT 10 
#define MAX_STD 10

//사운드
#pragma comment(lib,"winmm.lib")

//타입 구조체
typedef struct Data
{
    int  nStage;
    char szName[LENGTH];
}DATA;

//함수 선언하기
void chart();           //차트 화면 
void gotoxy(int, int);
void consoleframe();    //콘솔제목
void startMain();       //coin을 크게 보이게 출력하는 화면
int keyControl();
int menuDraw();
int sideDraw();
int settingDraw();
void menuCoin();
void sideCoin();
void cursor();
void setcolor(short, short);
void graph();
void RankSort(DATA* pData, int nSize);
void Print(DATA* pDAta, int nSize);
void SwapData(DATA* pLeft, DATA* pRight);
void ranking();
void stopMenu();    //일시정지에 사용
int stopDraw(); //일시정지에 사용
void intro();   //인트로
void skipintro(); //인트로 스킵



//필요한 변수 선언하기 ( 전역 변수 )
//코인 종류 선언
char coin1[99] = "* 도쿄코인";
char coin2[99] = "* 비트24";
char coin3[99] = "* 철권코인";
char coin4[99] = "* 미로코인";
char coin5[99] = "* 텀프코인";

//좌표값 초기화 및 선언 
int sx = 24;
int sy = 4;

int mx = 55;
int my = 16;

int stmy = 16;
int stmx = 55;

int setx = 55;
int sety = 20;

//메뉴 최소값 최대값 , 계산하기 편하라고 변수 선언
int menuMin = 16;
int menuMax = 20;

int sideMin = 5;
int sideMax = 13;

//메인 인트로 조정
int maincount = 0;

// 변동 폭이 작은 그래프
int b[200][20] =
{ {3, 6, 10, 17, 16, 5, 2, 1, 3, 5, 11, 18, 19, 7, 8, 16, 18, 5, 3, 6},
      {10, 5, 13, 10, 9, 3, 15, 16, 19, 9, 15, 4, 3, 10, 7, 15, 17, 13, 15, 8},
      {9, 3, 10, 17, 9, 15, 14, 8, 3, 2, 1, 4, 7, 10, 16, 13, 17, 16, 18, 15},
      {4, 2, 8, 12, 16, 9, 5, 4, 10, 12, 8, 6, 12, 14, 16, 17, 12, 7, 4, 2},
      {7, 3, 1, 2, 2, 3, 9, 12, 15, 12, 7, 4, 9, 15, 20, 19, 14, 12, 8, 3},
      {2, 7, 14, 16, 12, 9, 3, 2, 6, 10, 11, 18, 19, 7, 8, 16, 18, 5, 3, 6},
      {5, 6, 10, 14, 11, 12, 17, 9, 6, 2, 8, 11, 16, 9, 8, 10, 4, 3, 7, 13},
      {11, 13, 6, 12, 16, 10, 8, 11, 4, 2, 1, 2, 3, 10, 8, 13, 15, 19, 20, 19},
      {4, 7, 12, 8, 14, 16, 9, 10, 7, 3, 1, 3, 1, 7, 13, 18, 20, 17, 9, 6},
      {8, 3, 7, 10, 16, 5, 2, 1, 3, 5, 11, 18, 19, 12, 6, 15, 10, 6, 2, 8},
      {3, 7, 10, 14, 11, 8, 6, 9, 15, 7, 4, 7, 12, 19, 20, 13, 18, 14, 8, 12},
      {6, 1, 3, 5, 13, 17, 12, 5, 2, 10, 14, 16, 9, 6, 15, 17, 20, 14, 10, 5},
      {1, 6, 12, 11, 17, 8, 4, 3, 7, 12, 14, 18, 9, 2, 3, 10, 6, 2, 1, 1},
      {13, 7, 15, 8, 12, 7, 9, 3, 5, 11, 12, 18, 17, 12, 8, 16, 8, 5, 12, 7},
      {15, 14, 8, 14, 12, 17, 16, 10, 5, 2, 3, 5, 1, 7, 8, 16, 9, 5, 2, 3},
      {3, 2, 8, 12, 6, 3, 8, 12, 7, 8, 10, 6, 12, 16, 9, 12, 7, 2, 3, 8},
      {5, 10, 14, 15, 10, 9, 4, 1, 7, 16, 20, 16, 12, 17, 7, 14, 18, 16, 9, 5},
      {6, 10, 6, 1, 3, 10, 16, 14, 13, 17, 20, 20, 19, 18, 12, 9, 12, 16, 18, 20},
      {1, 3, 4, 3, 8, 6, 11, 16, 8, 7, 11, 18, 19, 12, 7, 6, 8, 3, 2, 1},
      {12, 13, 9, 4, 8, 3, 5, 10, 16, 12, 5, 3, 7, 4, 11, 13, 16, 8, 5, 12},
      {5, 4, 8, 12, 15, 7, 13, 8, 3, 2, 6, 11, 5, 7, 9, 11, 15, 8, 4, 2},
      {20, 19, 20, 16, 19, 11, 15, 9, 2, 9, 12, 14, 20, 19, 13, 11, 6, 14, 16, 19},
      {2, 3, 8, 7, 11, 15, 13, 7, 2, 1, 8, 12, 16, 17, 10, 6, 14, 17, 19, 20},
      {5, 10, 3, 7, 12, 16, 7, 8, 12, 5, 8, 9, 16, 13, 17, 10, 9, 5, 9, 7},
      {8, 5, 10, 17, 16, 14, 12, 6, 8, 9, 12, 16, 19, 12, 7, 3, 12, 18, 13, 7},
      {4, 3, 2, 7, 11, 6, 13, 17, 10, 4, 8, 7, 12, 15, 7, 14, 9, 4, 2, 7},
      {7, 4, 10, 12, 15, 8, 12, 11, 6, 7, 12, 18, 19, 5, 8, 12, 8, 4, 12, 16},
      {2, 1, 4, 8, 12, 5, 3, 7, 12, 14, 8, 14, 17, 11, 10, 5, 8, 15, 9, 12},
      {6, 3, 3, 11, 10, 8, 5, 12, 10, 8, 6, 15, 12, 14, 16, 17, 10, 6, 10, 12},
      {5, 2, 9, 7, 13, 6, 12, 7, 2, 9, 13, 15, 12, 7, 5, 12, 18, 19, 20, 14},
      {19, 12, 10, 7, 12, 14, 15, 8, 10, 6, 7, 14, 12, 11, 3, 1, 5, 7, 5, 2},
      {5, 4, 10, 12, 16, 8, 2, 7, 5, 12, 17, 18, 10, 6, 9, 12, 13, 17, 7, 4},
      {15, 13, 6, 12, 15, 8, 3, 5, 7, 12, 11, 13, 16, 7, 8, 6, 12, 15, 13, 3},
      {13, 16, 13, 12, 13, 6, 7, 12, 11, 6, 3, 7, 10, 15, 13, 6, 11, 16, 19, 20},
      {11, 13, 8, 12, 11, 7, 5, 2, 9, 12, 8, 4, 11, 16, 9, 12, 16, 17, 20, 8},
      {17, 14, 16, 14, 17, 12, 6, 11, 18, 19, 16, 15, 19, 10, 6, 3, 7, 10, 12, 5},
      {4, 7, 9, 11, 12, 9, 15, 12, 16, 12, 17, 18, 10, 5, 4, 12, 13, 8, 4, 2},
      {15, 12, 10, 11, 17, 9, 10, 6, 1, 5, 7, 12, 13, 17, 12, 11, 7, 10, 2, 9},
      {13, 7, 12, 11, 7, 3, 9, 13, 13, 15, 17, 12, 10, 7, 4, 5, 11, 12, 19, 20},
      {5, 8, 12, 13, 11, 16, 7, 5, 12, 15, 11, 8, 12, 6, 10, 4, 6, 10, 12, 16},
      {10, 7, 11, 13, 9, 10, 5, 4, 7, 12, 16, 18, 20, 19, 20, 10, 16, 11, 8, 5},
      {18, 14, 11, 15, 13, 8, 9, 5, 2, 7, 10, 15, 12, 8, 9, 16, 14, 8, 5, 2},
      {8, 7, 10, 12, 11, 8, 4, 2, 8, 10, 16, 14, 12, 7, 6, 12, 8, 14, 18, 20},
      {5, 12, 17, 9, 11, 8, 3, 6, 14, 15, 8, 8, 12, 7, 2, 1, 3, 8, 5, 9},
      {7, 2, 8, 12, 16, 7, 8, 2, 1, 1, 3, 1, 6, 7, 12, 16, 18, 20, 19, 20},
      {8, 14, 12, 17, 13, 9, 7, 5, 2, 4, 11, 16, 16, 12, 7, 5, 2, 8, 12, 15},
      {4, 13, 8, 13, 16, 12, 9, 12, 11, 6, 3, 1, 9, 7, 10, 12, 8, 4, 13, 15},
      {13, 17, 15, 12, 8, 5, 4, 2, 6, 2, 8, 11, 13, 5, 3, 10, 15, 17, 12, 19},
      {1, 2, 5, 9, 3, 6, 13, 16, 17, 20, 13, 12, 16, 18, 10, 8, 8, 6, 4, 9},
      {4, 7, 12, 16, 8, 10, 12, 13, 7, 8, 3, 11, 8, 7, 3, 4, 7, 13, 18, 20},
      {13, 6, 7, 3, 6, 12, 15, 7, 12, 13, 9, 10, 11, 12, 4, 5, 2, 3, 1, 6},
      {6, 3, 4, 8, 14, 16, 20, 17, 13, 6, 3, 11, 15, 16, 17, 8, 10, 9, 4, 3},
      {5, 4, 11, 14, 15, 10, 11, 6, 3, 6, 7, 15, 9, 5, 3, 2, 8, 12, 13, 16},
      {17, 15, 10, 17, 13, 7, 8, 3, 9, 14, 11, 15, 20, 17, 18, 13, 10, 15, 8, 6},
      {16, 17, 13, 10, 15, 18, 20, 20, 14, 7, 7, 8, 3, 8, 9, 12, 4, 3, 2, 1},
      {18, 19, 20, 17, 16, 10, 4, 5, 2, 8, 12, 8, 13, 16, 8, 11, 9, 4, 2, 6},
      {10, 13, 15, 14, 16, 9, 6, 3, 1, 1, 2, 3, 2, 7, 9, 6, 8, 15, 13, 16},
      {13, 5, 8, 5, 10, 12, 7, 8, 3, 5, 12, 13, 8, 4, 3, 5, 12, 9, 6, 7},
      {7, 8, 10, 12, 11, 4, 3, 2, 6, 8, 12, 15, 19, 9, 6, 5, 3, 2, 3, 1},
      {14, 9, 10, 13, 18, 11, 8, 3, 6, 8, 3, 2, 9, 15, 20, 20, 13, 5, 3, 8},
      {18, 17, 12, 7, 8, 3, 6, 3, 2, 8, 13, 12, 11, 12, 16, 8, 9, 10, 11, 6},
      {7, 4, 8, 15, 17, 16, 18, 20, 20, 13, 16, 18, 19, 11, 8, 6, 8, 7, 2, 1},
      {16, 13, 9, 4, 11, 7, 13, 16, 13, 7, 11, 4, 2, 10, 8, 16, 12, 15, 8, 3},
      {1, 2, 6, 10, 4, 7, 3, 11, 15, 7, 9, 6, 10, 4, 2, 3, 1, 4, 7, 3},
      {4, 3, 8, 4, 1, 8, 12, 14, 13, 6, 12, 15, 19, 20, 15, 17, 20, 17, 11, 10},
      {11, 13, 8, 5, 12, 13, 15, 18, 3, 5, 11, 10, 15, 9, 5, 10, 14, 9, 10, 7},
      {12, 15, 8, 11, 7, 5, 10, 15, 14, 15, 10, 14, 8, 6, 11, 15, 12, 17, 13, 9},
      {8, 6, 10, 12, 14, 9, 7, 6, 10, 13, 11, 17, 16, 10, 6, 5, 6, 10, 5, 2},
      {4, 7, 10, 13, 14, 10, 7, 7, 8, 9, 13, 16, 19, 12, 10, 7, 4, 3, 1, 2},
      {17, 13, 14, 9, 6, 12, 9, 10, 6, 11, 15, 13, 17, 14, 19, 10, 13, 7, 5, 6},
      {14, 11, 5, 6, 11, 13, 15, 8, 14, 8, 9, 10, 5, 11, 13, 14, 11, 15, 16, 9},
      {5, 8, 11, 8, 3, 6, 4, 1, 3, 8, 16, 13, 17, 17, 10, 9, 16, 9, 5, 3},
      {4, 10, 10, 5, 11, 15, 14, 17, 12, 10, 3, 5, 2, 3, 9, 11, 10, 5, 8, 14},
      {14, 16, 10, 7, 12, 13, 8, 5, 4, 6, 7, 10, 11, 8, 14, 15, 10, 6, 2, 4},
      {11, 7, 10, 4, 5, 10, 12, 16, 13, 7, 8, 8, 15, 16, 19, 15, 20, 13, 10, 6},
      {9, 10, 7, 13, 14, 11, 6, 6, 4, 10, 16, 17, 11, 8, 9, 6, 10, 5, 6, 10},
      {17, 12, 10, 16, 9, 4, 2, 3, 1, 7, 1, 1, 9, 13, 15, 16, 19, 13, 10, 4},
      {20, 20, 15, 18, 19, 10, 4, 11, 5, 13, 11, 15, 14, 16, 16, 17, 18, 18, 15, 19},
      {12, 8, 7, 10, 14, 16, 11, 9, 5, 5, 4, 10, 15, 14, 16, 10, 16, 8, 9, 4},
      {7, 4, 8, 10, 8, 11, 15, 7, 8, 10, 6, 1, 2, 3, 2, 7, 11, 17, 15, 18},
      {15, 13, 10, 5, 4, 9, 13, 16, 16, 14, 18, 13, 9, 11, 5, 6, 1, 4, 1, 8},
      {4, 8, 10, 6, 7, 14, 13, 16, 19, 11, 13, 9, 6, 11, 7, 4, 10, 5, 2, 3},
      {7, 11, 10, 16, 16, 9, 5, 12, 14, 15, 10, 8, 4, 3, 8, 9, 16, 14, 15, 12},
      {7, 12, 13, 10, 5, 4, 8, 14, 16, 17, 13, 18, 19, 13, 11, 8, 7, 9, 5, 4},
      {8, 9, 7, 14, 13, 8, 4, 5, 9, 13, 15, 18, 10, 6, 5, 11, 12, 7, 4, 5},
      {2, 6, 8, 13, 12, 11, 7, 5, 4, 9, 12, 16, 14, 10, 5, 4, 2, 9, 15, 18},
      {9, 5, 4, 10, 6, 8, 14, 15, 12, 16, 11, 10, 9, 8, 8, 16, 15, 14, 17, 17},
      {14, 15, 10, 17, 14, 7, 5, 6, 11, 12, 10, 6, 9, 14, 16, 16, 8, 6, 3, 11},
      {11, 6, 5, 10, 4, 12, 8, 15, 7, 13, 10, 16, 11, 17, 15, 19, 11, 5, 10, 4},
      {15, 14, 10, 7, 6, 15, 12, 11, 13, 5, 1, 8, 9, 17, 18, 6, 15, 15, 13, 16},
      {13, 16, 10, 7, 12, 13, 7, 9, 5, 5, 11, 15, 18, 19, 18, 11, 6, 10, 4, 6},
      {2, 5, 3, 8, 10, 16, 9, 6, 5, 2, 1, 1, 7, 12, 15, 13, 10, 19, 20, 20},
      {11, 4, 8, 7, 6, 10, 15, 14, 7, 8, 12, 15, 8, 16, 18, 10, 14, 11, 6, 10},
      {5, 10, 10, 17, 13, 8, 5, 4, 3, 6, 12, 16, 9, 5, 4, 10, 12, 15, 14, 13},
      {9, 5, 10, 14, 13, 15, 12, 6, 4, 4, 10, 16, 13, 7, 8, 13, 18, 15, 10, 6},
      {6, 2, 8, 12, 15, 11, 10, 7, 4, 8, 9, 12, 11, 15, 14, 18, 15, 16, 13, 16},
      {11, 6, 2, 1, 1, 2, 3, 2, 7, 9, 10, 14, 7, 3, 5, 10, 16, 18, 20, 15},
      {5, 4, 10, 16, 14, 11, 7, 5, 6, 13, 16, 17, 19, 20, 12, 6, 7, 4, 8, 13},
      {7, 4, 3, 8, 15, 13, 16, 10, 7, 13, 11, 4, 9, 6, 1, 5, 1, 1, 6, 10},
      { 5, 6, 11, 7, 6, 15, 12, 11, 13, 6, 1, 7, 9, 17, 18, 16, 20, 15, 13, 16 },
      {5, 3, 7, 7, 6, 5, 7, 9, 10, 13, 10, 11, 13, 14, 16, 16, 18, 19, 16, 15},
      {4, 8, 10, 14, 11, 7, 5, 3, 2, 3, 1, 4, 9, 7, 8, 10, 14, 15, 13, 16},
      {1, 3, 2, 5, 4, 9, 6, 10, 13, 15, 11, 8, 9, 7, 10, 6, 8, 11, 13, 17},
      {16, 14, 10, 7, 10, 7, 8, 11, 14, 13, 10, 8, 9, 7, 4, 6, 8, 12, 16, 13},
      {13, 10, 8, 7, 6, 10, 13, 16, 17, 20, 20, 18, 14, 15, 12, 10, 9, 7, 4, 6},
      {2, 4, 5, 8, 5, 6, 3, 8, 10, 12, 13, 11, 9, 13, 16, 17, 15, 15, 13, 10},
      {4, 8, 10, 11, 9, 6, 7, 10, 14, 11, 12, 8, 8, 7, 8, 6, 4, 5, 7, 9},
      {6, 5, 9, 10, 6, 8, 11, 13, 12, 16, 15, 13, 14, 17, 18, 15, 12, 10, 9, 7},
      {11, 13, 10, 12, 9, 6, 7, 10, 9, 12, 14, 13, 13, 15, 16, 18, 15, 16, 17, 20},
      {14, 12, 10, 11, 13, 15, 11, 8, 9, 6, 7, 6, 5, 3, 1, 1, 4, 3, 2, 5},
      {5, 4, 1, 3, 7, 6, 10, 12, 11, 14, 15, 14, 14, 11, 8, 12, 11, 15, 16, 17},
      { 7, 8, 10, 13, 12, 14, 11, 8, 5, 5, 6, 7, 10, 12, 14, 15, 12, 11, 7, 6 },
      { 14, 15, 17, 17, 14, 15, 12, 11, 8, 9, 6, 4, 8, 9, 8, 7, 10, 12, 14, 16 },
      { 3, 4, 6, 7, 5, 4, 3, 6, 8, 10, 7, 8, 11, 13, 13, 10, 8, 9, 14, 15 },
      { 6, 6, 7, 10, 6, 8, 12, 15, 14, 16, 13, 10, 9, 7, 8, 6, 3, 2, 3, 4 },
      { 10, 11, 10, 13, 13, 15, 12, 11, 7, 8, 6, 6, 7, 11, 13, 12, 8, 5, 4, 2 },
      { 4, 6, 7, 7, 6, 8, 5, 4, 7, 11, 12, 16, 19, 20, 20, 18, 19, 15, 14, 11 },
      { 7, 6, 8, 12, 16, 13, 11, 9, 13, 15, 12, 11, 13, 17, 14, 10, 8, 11, 7, 6 },
      { 11, 13, 12, 15, 16, 15, 11, 8, 6, 7, 11, 14, 16, 18, 15, 11, 7, 3, 1, 1 },
      { 16, 13, 10, 12, 16, 13, 17, 20, 20, 19, 20, 18, 16, 12, 15, 11, 7, 10, 12, 8 },
      { 13, 15, 10, 11, 11, 7, 8, 11, 12, 14, 15, 16, 15, 17, 20, 18, 20, 16, 11, 16 },
      { 13, 11, 10, 7, 12, 7, 8, 5, 2, 5, 3, 6, 3, 2, 7, 10, 12, 7, 6, 4 },
      { 12, 10, 8, 7, 4, 5, 6, 9, 13, 11, 11, 12, 16, 17, 13, 12, 11, 14, 9, 6 },
      { 6, 7, 10, 8, 11, 7, 4, 5, 10, 11, 14, 15, 13, 9, 5, 2, 1, 2, 1, 4 },
      { 7, 5, 4, 7, 10, 12, 11, 14, 14, 13, 15, 11, 9, 10, 7, 6, 9, 12, 15, 13 },
      { 5, 4, 8, 11, 13, 10, 12, 11, 13, 15, 11, 9, 6, 7, 10, 12, 13, 12, 13, 16 },
      { 11, 14, 13, 13, 11, 12, 8, 9, 8, 6, 5, 3, 1, 2, 1, 5, 3, 6, 9, 12 },
      { 8, 6, 10, 13, 12, 15, 16, 13, 11, 8, 6, 7, 9, 4, 1, 3, 7, 5, 4, 8 },
      { 8, 11, 12, 15, 13, 12, 16, 15, 17, 20, 20, 19, 17, 19, 20, 16, 12, 15, 17, 16 },
      { 6, 5, 8, 7, 10, 8, 5, 8, 12, 11, 13, 11, 14, 10, 8, 9, 10, 13, 11, 12 },
      { 12, 10, 10, 7, 6, 9, 8, 9, 13, 12, 11, 14, 15, 15, 12, 14, 18, 17, 16, 16 },
      { 7, 5, 4, 7, 6, 4, 7, 3, 2, 5, 1, 1, 5, 7, 8, 9, 7, 10, 6, 3 },
      { 8, 7, 5, 7, 6, 3, 7, 10, 13, 15, 11, 10, 9, 7, 6, 10, 11, 12, 14, 13 },
      { 14, 15, 11, 12, 9, 8, 10, 10, 8, 7, 7, 4, 8, 9, 8, 6, 8, 11, 13, 13 },
      { 19, 15, 14, 16, 17, 18, 16, 17, 18, 20, 17, 13, 14, 12, 9, 11, 7, 5, 1, 1 },
      { 15, 12, 10, 9, 12, 12, 11, 10, 13, 15, 18, 15, 14, 11, 10, 8, 7, 7, 10, 12 },
      { 6, 9, 8, 9, 7, 10, 8, 10, 13, 12, 11, 12, 10, 9, 8, 6, 8, 11, 13, 12 },
      { 7, 5, 4, 8, 12, 10, 14, 13, 15, 11, 7, 8, 5, 2, 5, 6, 8, 12, 16, 14 },
      { 8, 6, 11, 14, 13, 16, 12, 8, 5, 3, 6, 8, 9, 7, 11, 14, 10, 13, 12, 8 },
      { 1, 3, 5, 4, 6, 5, 8, 11, 13, 12, 8, 8, 9, 5, 6, 10, 13, 12, 15, 11 },
      { 5, 6, 8, 7, 10, 12, 11, 13, 13, 15, 14, 18, 20, 19, 18, 16, 17, 13, 9, 12 },
      { 11, 14, 13, 17, 18, 14, 13, 11, 8, 6, 7, 7, 9, 7, 11, 13, 14, 10, 7, 6 },
      { 8, 7, 11, 14, 14, 15, 11, 13, 16, 15, 12, 9, 6, 8, 8, 6, 7, 11, 13, 9 },
      { 7, 9, 12, 14, 13, 9, 11, 7, 5, 8, 8, 9, 13, 13, 15, 12, 16, 15, 18, 20 },
      { 16, 13, 12, 16, 17, 14, 10, 11, 8, 6, 4, 8, 10, 12, 9, 6, 3, 2, 1, 3 },
      { 8, 7, 10, 13, 12, 16, 17, 20, 18, 14, 15, 13, 9, 6, 5, 5, 7, 5, 4, 1 },
      { 8, 12, 9, 7, 10, 12, 13, 16, 15, 11, 11, 9, 7, 8, 12, 16, 13, 14, 16, 12 },
      { 4, 7, 8, 10, 13, 12, 8, 5, 7, 11, 12, 15, 13, 11, 12, 9, 6, 7, 4, 2 },
      { 14, 17, 19, 18, 16, 14, 12, 10, 7, 4, 2, 5, 8, 12, 11, 9, 5, 1, 2, 7 },
      { 6, 4, 1, 3, 7, 9, 12, 13, 16, 14, 12, 11, 9, 6, 8, 8, 10, 12, 13, 16 },
      { 7, 7, 11, 10, 13, 9, 7, 6, 4, 5, 4, 2, 6, 10, 14, 13, 12, 13, 14, 17 },
      { 7, 10, 13, 14, 15, 17, 16, 12, 11, 8, 5, 4, 7, 10, 12, 11, 14, 15, 11, 8 },
      { 14, 16, 12, 8, 7, 10, 11, 9, 9, 6, 4, 8, 5, 2, 1, 1, 4, 3, 4, 7 },
      { 14, 17, 15, 12, 12, 14, 11, 13, 9, 8, 5, 8, 6, 6, 4, 9, 11, 14, 13, 16 },
      { 15, 18, 14, 13, 16, 12, 11, 10, 14, 17, 18, 20, 19, 20, 17, 13, 15, 11, 8, 5 },
      { 9, 5, 2, 4, 3, 5, 6, 2, 3, 5, 7, 11, 14, 12, 9, 10, 11, 8, 4, 5 },
      { 15, 12, 13, 17, 18, 20, 17, 13, 9, 5, 2, 1, 3, 7, 4, 8, 11, 12, 14, 13 },
      { 8, 4, 6, 4, 3, 5, 7, 10, 13, 12, 8, 9, 13, 17, 12, 9, 6, 4, 6, 5 },
      { 3, 2, 7, 5, 6, 10, 13, 11, 13, 15, 11, 8, 12, 10, 6, 2, 3, 6, 5, 4 },
      { 3, 4, 3, 5, 6, 10, 12, 11, 13, 9, 5, 1, 2, 1, 5, 6, 4, 8, 12, 13 },
      { 7, 10, 11, 12, 8, 9, 10, 7, 5, 2, 3, 7, 9, 11, 15, 18, 20, 20, 18, 19 },
      { 8, 10, 13, 9, 7, 8, 6, 3, 4, 2, 1, 4, 3, 7, 5, 6, 10, 12, 11, 13 },
      { 10, 14, 13, 15, 16, 12, 12, 11, 10, 6, 3, 5, 7, 7, 8, 12, 9, 5, 3, 1 },
      { 11, 13, 9, 12, 16, 15, 12, 10, 7, 8, 12, 14, 15, 12, 11, 7, 4, 3, 2, 6 },
      { 13, 12, 8, 7, 11, 10, 12, 13, 9, 5, 3, 1, 1, 3, 2, 6, 8, 4, 1, 2 },
      { 4, 7, 8, 5, 9, 12, 11, 10, 6, 7, 3, 5, 4, 3, 6, 6, 8, 12, 15, 16 },
      { 10, 6, 7, 11, 15, 17, 13, 11, 12, 15, 16, 18, 19, 20, 16, 14, 15, 17, 13, 14 },
      { 16, 13, 12, 15, 14, 10, 10, 7, 6, 8, 9, 13, 12, 15, 16, 20, 20, 18, 19, 20 },
      { 5, 4, 8, 6, 7, 11, 12, 14, 13, 10, 9, 8, 5, 3, 2, 1, 4, 3, 6, 7 },
      { 11, 15, 12, 14, 10, 6, 2, 3, 3, 4, 8, 9, 13, 12, 15, 11, 7, 4, 8, 12 },
      { 6, 6, 7, 10, 13, 15, 12, 8, 4, 6, 10, 14, 15, 16, 12, 11, 13, 9, 5, 2 },
      { 10, 13, 9, 5, 4, 3, 2, 2, 3, 4, 7, 11, 15, 18, 16, 12, 15, 13, 16, 18 },
      { 14, 12, 8, 9, 13, 16, 19, 17, 18, 16, 12, 8, 9, 11, 7, 4, 3, 1, 2, 1 },
      { 11, 13, 10, 10, 12, 11, 8, 4, 5, 3, 8, 10, 14, 12, 16, 19, 19, 16, 17, 13 },
      { 7, 10, 13, 14, 11, 7, 8, 5, 2, 1, 3, 4, 8, 5, 6, 10, 12, 14, 13, 16 },
      { 1, 3, 5, 17, 16, 5, 2, 1, 3, 5, 11, 18, 19, 7, 8, 16, 18, 20, 19, 15 },
      { 5, 4, 7, 11, 13, 9, 6, 3, 7, 5, 6, 9, 10, 12, 11, 14, 15, 11, 10, 10 },
      { 8, 4, 6, 7, 11, 9, 10, 10, 13, 16, 12, 8, 4, 2, 3, 1, 1, 4, 3, 2 },
      { 16, 16, 13, 12, 13, 15, 18, 17, 13, 9, 5, 8, 7, 4, 1, 3, 6, 9, 12, 15 },
      { 15, 12, 13, 9, 7, 3, 5, 4, 5, 6, 8, 11, 10, 10, 7, 5, 5, 6, 3, 7 },
      { 7, 10, 7, 8, 8, 11, 12, 9, 7, 4, 8, 12, 15, 13, 17, 14, 11, 9, 12, 15 },
      { 10, 11, 14, 15, 12, 8, 9, 6, 7, 11, 8, 6, 5, 1, 3, 8, 6, 10, 11, 8 },
      { 11, 14, 18, 15, 16, 13, 9, 6, 2, 5, 1, 3, 2, 6, 10, 12, 11, 15, 11, 7 },
      { 8, 10, 9, 7, 5, 2, 5, 9, 12, 15, 13, 14, 17, 17, 18, 20, 18, 19, 15, 18 },
      { 6, 10, 7, 11, 8, 4, 5, 9, 12, 15, 11, 10, 10, 7, 4, 1, 5, 5, 2, 6 },
      { 2, 5, 7, 10, 8, 9, 5, 2, 6, 9, 12, 11, 13, 10, 8, 5, 7, 11, 13, 17 },
      { 4, 7, 11, 8, 9, 13, 15, 17, 18, 16, 12, 15, 19, 20, 18, 17, 19, 15, 11, 13 },
      { 10, 11, 8, 10, 9, 5, 3, 2, 6, 6, 4, 1, 5, 9, 7, 11, 10, 12, 11, 14 },
      { 8, 12, 10, 14, 18, 15, 12, 14, 17, 13, 10, 6, 9, 7, 6, 10, 7, 3, 5, 9 },
      { 13, 16, 15, 11, 11, 12, 16, 20, 17, 13, 9, 7, 5, 6, 8, 10, 14, 11, 13, 9 },
      { 8, 9, 5, 1, 3, 7, 11, 14, 13, 9, 12, 15, 16, 12, 8, 10, 9, 7, 9, 12 },
      { 11, 13, 10, 7, 9, 13, 12, 15, 13, 9, 7, 11, 15, 17, 20, 18, 19, 15, 16, 14 },
      { 7, 10, 9, 5, 6, 2, 1, 2, 1, 4, 7, 11, 9, 10, 14, 13, 12, 11, 15, 12 },
      { 9, 10, 13, 17, 14, 10, 8, 5, 2, 6, 10, 14, 13, 16, 17, 16, 20, 20, 18, 15 },
      { 13, 9, 11, 15, 16, 12, 14, 10, 8, 10, 9, 13, 15, 16, 18, 17, 20, 17, 14, 15 },
      { 7, 3, 5, 2, 3, 7, 11, 10, 12, 14, 11, 15, 19, 17, 17, 13, 9, 6, 7, 3 },
      { 4, 7, 10, 14, 13, 14, 12, 15, 11, 8, 7, 9, 9, 10, 6, 8, 12, 14, 13, 17 },
      { 9, 11, 11, 15, 14, 10, 12, 13, 17, 16, 18, 15, 16, 12, 9, 11, 7, 5, 1, 2 },
      { 9, 5, 7, 11, 8, 4, 4, 6, 10, 13, 17, 20, 19, 16, 12, 15, 13, 16, 12, 10 },
      { 1, 6, 9, 12, 8, 11, 8, 5, 9, 13, 12, 8, 10, 13, 11, 15, 14, 17, 19, 20 }
};

//메인 함수
int main()
{

    cursor(0);
    //콘솔 입력 깜빡임 ,커서 제거 (이동훈) 보기 깔끔하게 하려고 함
    srand(time(NULL));
    //main에서 시간 초기화 해야 아래 함수 랜덤 사용가능하다.
    consoleframe();
    PlaySound(TEXT("funky.wav"), NULL, SND_ASYNC | SND_LOOP);   //배경 음악 출력 

    if(maincount==0)intro();                                    //시작할때 인트로 포함
    else skipintro();                                           //메인으로 가서 시작할때 인트로 스킵
    
    ranking();
   
    return 0;
}

//콘솔 제목변경과 콘솔 크기 고정
void consoleframe()
{
    system("title 2CPB 6조 가상화폐 모의투자 프로그램");
    system("mode con cols=120 lines=40");
}

//시작 화면
void startMain()
{
    //인터페이스
    gotoxy(sx, sy);
    printf("    ■■■■　　　　　■■■　　　　　■■■■■　　　■■　　　　■　\n");
    gotoxy(sx, wherey());
    printf("  ■　　　　■　　　■　　　■　　　　　　■　　　　　■■　　　　■　\n");
    gotoxy(sx, wherey());
    printf("■　　　　　　　　■　　　　　■　　　　　■　　　　　■　■　　　■　\n");
    gotoxy(sx, wherey());
    printf("■　　　　　　　　■　　　　　■　　　　　■　　　　　■　■　　　■　\n");
    gotoxy(sx, wherey());
    printf("■　　　　　　　　■　　　　　■　　　　　■　　　　　■　　■　　■　\n");
    gotoxy(sx, wherey());
    printf("■　　　　　　　　■　　　　　■　　　　　■　　　　　■　　■　　■　\n");
    gotoxy(sx, wherey());
    printf("■　　　　　　　　■　　　　　■　　　　　■　　　　　■　　　■　■　\n");
    gotoxy(sx, wherey());
    printf("■　　　　　　　　■　　　　　■　　　　　■　　　　　■　　　■　■　\n");
    gotoxy(sx, wherey());
    printf("　■　　　　■　　　■　　　■　　　　　　■　　　　　■　　　　■■　\n");
    gotoxy(sx, wherey());
    printf("    ■■■■　　　　　■■■　　　　　■■■■■　　　■　　　　■■　\n");
}

//코인 메뉴 출력/선택 (메인화면) 함수
void menuCoin()
{
    //방향키 입력을 위한 좌표(기본값) 초기화
    mx = 55;
    my = 16;

    //추후에 종목이 많아질 경우, 콘솔의 세로를 늘리거나, 종목 간의 거리(2)를 1(my++;)으로 줄일 예정
    //이에 따라 menuNum 계산식 그리고 my 좌표 계산식도 바뀔 예정
    gotoxy(49, my);
    printf("┌─────────────────┐");
    for (int i = 17; i < 24; i++) {
        gotoxy(49, i); printf("│                 │");
    }
    gotoxy(49, wherey() + 1);
    printf("└─────────────────┘");
    gotoxy(mx - 2, my + 2);
    printf("> 시　　작");
    gotoxy(mx, wherey() + 2);
    printf("설　　정");
    gotoxy(mx, wherey() + 2);
    printf("종　　료");

    int menuNum = menuDraw();

    //시작 선택 시
    if (menuNum == 0) {

        system("cls");
        startMain();
        graph();
        //menuCoin();        

        setx = 52;
        sety = 16;
        // 종목 선택 틀 디자인
        gotoxy(setx - 5, sety);
        printf("┌─────────────────┐");
        for (int i = 1; i < 12; i++) {
            gotoxy(setx - 5, sety + i);
            printf("│                 │ ");
        }
        gotoxy(setx - 5, sety + 12);
        printf("└─────────────────┘");

        mx = 51;
        my = 16;
        sideCoin();

        sideMin = 18;
        sideMax = 26;
        int sideNum = sideDraw();




        //메뉴에 맞는 차트 보여주려고 식별함.
        if (sideNum == 0) //선택한 코인에 맞는 변수 확인절차
        {
            setcolor(0, 7);
            printf(" * 도쿄코인");
            setcolor(7, 0);
            //도쿄코인에 맞는 코드 작성 부탁드립니다.
            Sleep(400);
            system("cls");
            chart();
        }
        else if (sideNum == 1)
        {
            setcolor(0, 7);
            printf(" * 비트24");
            setcolor(7, 0);
            //비트24에 맞는 코드 작성 부탁드립니다.
            Sleep(200);
            system("cls");
            chart();
        }
        else if (sideNum == 2)
        {
            setcolor(0, 7);
            printf(" * 철권코인");
            setcolor(7, 0);
            //철권코인에 맞는 코드 작성 부탁드립니다.
            Sleep(200);
            system("cls");
            chart();
        }
        else if (sideNum == 3)
        {
            setcolor(0, 7);
            printf(" * 미로코인");
            setcolor(7, 0);
            //미로코인에 맞는 코드 작성 부탁드립니다.
            Sleep(200);
            system("cls");
            chart();
        }
        else if (sideNum == 4)
        {
            setcolor(0, 7);
            printf(" * 텀프코인");
            setcolor(7, 0);
            //텀프코인에 맞는 코드 작성 부탁드립니다.
            Sleep(200);
            system("cls");
            chart();
        }
        else
        {
            //좌표 에러거나 오류 발생 시 맞는 코드 작성 부탁드립니다.
            Sleep(2000);
        }
    }
    //배경음악 선택 시 
    else if (menuNum == 1) {
        setx = 55;
        sety = 20;

        // 배경음악 설정 틀 디자인
        gotoxy(setx - 6, sety - 4);
        printf("┌─────────────────┐");
        for (int i = -3; i < 4; i++) {
            gotoxy(setx - 6, sety - i);
            printf("│                 │ ");
        }
        gotoxy(setx - 6, sety + 4);
        printf("└─────────────────┘");

        // 배경음악 ON OFF 출력
        gotoxy(setx - 2, sety - 2);
        printf("배 경  음 악");
        gotoxy(setx - 1, sety);        //ON 기본값, 검은 글자에 흰 배경
        setcolor(0, 7);
        printf(" ON ");
        gotoxy(setx + 5, sety);      //OFF , 검은 글자에 흰 배경 --> 흰 글자에 검은 배경(콘솔 기본값)으로 되돌림
        setcolor(7, 0);
        printf(" OFF ");
        gotoxy(setx - 3, sety + 2);
        printf("ESC : 돌아가기");
        
        
        while (1) {
            int settingNum = settingDraw();
            if (settingNum == 0)
                PlaySound(TEXT("funky.wav"), NULL, SND_ASYNC | SND_LOOP);
            else if (settingNum == 1)
                PlaySound(NULL, 0, 0);
            else if (settingNum == -1)
            {
                startMain();
                menuCoin();
            }
        }
        while (1)
        {
            int settingNum = settingDraw();
        }
    }
    //종료 선택 시
    else if (menuNum == 2)
    {
    printf("\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n");
        exit(0);
    }
}

//사이드 부분 코인 메뉴 출력/선택 (메인화면 제외) 함수
void sideCoin()
{
    //추후에 종목이 많아질 경우, 콘솔의 세로를 늘리거나, 종목 간의 거리(2)를 1(my++;)으로 줄일 예정
    //이에 따라 menuNum 계산식 그리고 my 좌표 계산식도 바뀔 예정
    gotoxy(mx - 2, my);
    printf("> 가상화폐 선택 ");
    gotoxy(mx, wherey() + 2);
    printf("%s", coin1);
    gotoxy(mx, wherey() + 2);
    printf("%s", coin2);
    gotoxy(mx, wherey() + 2);
    printf("%s", coin3);
    gotoxy(mx, wherey() + 2);
    printf("%s", coin4);
    gotoxy(mx, wherey() + 2);
    printf("%s", coin5);
}
void stopMenu()
{
    //일시정지 후 오른쪽 사이드메뉴
    gotoxy(mx - 2, my);
    printf("  일시정지 [ESC] ");
    gotoxy(mx, wherey() + 2);
    printf(" 계 속 하 기 ");
    gotoxy(mx, wherey() + 2);
    printf(" 다 시 하 기 ");
    gotoxy(mx, wherey() + 2);
    printf(" 메 인 으 로 ");
    
}
//차트확인용 실시간(타이머)
void chart() {
    int i, j, count = 1, buy, max = 20, cnt, color, num[200][20];
    // 계좌 및 수익률을 위한 변수선언 ↓
    float account = 1000.0;            // 잔고
    float fund = account;               // 시드머니
    float coin_quantity = 0;            // 구입한 코인수
    float purchase_price = 0.0;     // 매입가(매수시 코인가격)
    float purchase_amount = 0.0;    //매입금액(매수할때 사용한 현금의 총액, 원금)
    int buy_count = 0;          // 구매 횟수
    float yield = 0.0;              // 수익률
    float total_yield = 0.0;        //총 수익률
    float real_profit = 0.0;        //실현 수익

    memcpy(num, b, sizeof(b));
    int r = rand() % 200 + 1;
    num[r][100];

    srand(time(NULL));
    color = rand() % (36 - 31 + 1) + 31;
    while (count <= 20) {
        int time1 = time(0);
        //기본 시간 설정

        for (i = 0; i < count; i++) //x축 20줄만 뽑을 예정
        {
            if (num[r][i] > max)   // max는 y축의 최대치를 결정한다
                max = num[r][i];
            if (num[r][i] == 0)
                break;
        }
        cnt = i;
        gotoxy(8, 0);
        printf("\n");
        printf("\t┌─────────────────────────────────────────────────────────────────────────────────────┬────────────────────┐\n");

        for (i = 0; i < max; i++)  //y축 숫자표시
        {
            if (i % 5 == 0 || i == 19) {   // 1부터 20을 표현하기에는 너무 지저분해보여서 5의 배수와 1로 나타내기로 함
                printf("\t│ %2d", max - i);

            }
            else
                printf("\t│   ");  // 5의 배수와 1이 아닌 경우 스페이스바 2개(공백) 처리함

            for (j = 0; j < cnt; j++) // 막대 그래프 한줄씩 출력
                                    // 주의 ! 세로기준이 아니라 배열 값에따라 위에서 부터 내려옴
                if (max - i <= num[r][j]) {

                    printf("\x1b[%dm" "l■l" "\x1b[0m", color);
                }
                else
                    printf("    ");
            printf("\n");
        }
        printf("\t│   | 1|");
        for (int x = 2; x <= 20; x++) {	//x축 숫자표시
            printf("|%2d|", x);
        }

        printf("\n\t└─────────────────────────────────────────────────────────────────────────────────────┴────────────────────┘");

        for (int i = 2; i < 23; i++) {          //인터페이스
            gotoxy(94, i); printf("│");
            gotoxy(115, i); printf("│");
        }

        //방향키 입력을 위한 좌표(기본값) 초기화
        mx = 100;
        my = 3;
        stopMenu();


        gotoxy(8, 24);      //인터페이스 수정 : 첨삭할 항목 적어두시면 수정하겠습니다(박유빈)
        printf("┌──────────────┐");
        gotoxy(23, 25); printf("│");
        gotoxy(8, 25);
        printf("│  현재가 : %2d", num[r][count - 1]);
        gotoxy(8, 26);
        printf("├──────────────┴────────────┬──────────────────────┬───────────────────────┐");
        yield = ((num[r][count - 1] - purchase_price) / purchase_price) * 100; //수익률 계산식
        gotoxy(8, 27);
        printf("│  평가금액 : %.3f", (coin_quantity * num[r][count - 1]));
        gotoxy(38, 27);
        printf("매입가 : % .3f", purchase_price);

        // 수익률에 inf 값이 화면에 출력되는 부분 수정
        if (purchase_price == 0) {
            gotoxy(61, 27);
            printf("수익률 : 0 % %\n", yield);
        }
        else {
            gotoxy(61, 27);
            printf("수익률 : % .3f % %\n", yield);
        }

        gotoxy(83, 27); printf("│");
        gotoxy(36, 27); printf("│");
        gotoxy(59, 27); printf("│");
        gotoxy(8, 28);
        printf("├───────────────────────────┼──────────────────────┼───────────────────────┤");
        gotoxy(8, 29);
        printf("│  매입금액 : %.3f", purchase_amount);
        gotoxy(36, 29);
        printf("│ 실현손익 : % .3f\t\t\t\t\t\n", real_profit);
        gotoxy(59, 29);
        printf("│ 총수익률 : %.3f%%", ((((1000 + real_profit) - 1000) / 1000) * 100));
        gotoxy(83, 29);
        printf("│");
        gotoxy(8, 30);
        printf("├───────────────────────────┼──────────────────────┴───────────────────────┘");
        gotoxy(8, 31);
        printf("│  매수 [0] 매도 [1] : \t    │");
        gotoxy(8, 32);
        printf("└───────────────────────────┘");



        //2초 지나면 자동으로 넘어감
        while (time(0) - time1 <= 0.2) {        //0.2 바꾸면 시간 조정가능
            if (_kbhit()) {
                gotoxy(31, 31);
                buy = _getch();

                if (buy == 27)
                {
                    gotoxy(10, 5);
                    printf("┌────────────────────────────────────────────────────────────────────────────────┐\n");
                    gotoxy(10, 6);
                    printf("│    ■■■      ■          ■        ■    ■■■■■    ■    ■■■■■    ■\n");
                    gotoxy(10, 7);
                    printf("│  ■      ■    ■          ■        ■        ■        ■        ■        ■\n");
                    gotoxy(10, 8);
                    printf("│  ■      ■    ■          ■        ■        ■    ■■■        ■        ■\n");
                    gotoxy(10, 9);
                    printf("│  ■      ■    ■          ■        ■        ■        ■        ■        ■\n");
                    gotoxy(10, 10);
                    printf("│    ■■■      ■          ■        ■      ■  ■      ■        ■        ■\n");
                    gotoxy(10, 11);
                    printf("│                          ■  ■      ■    ■      ■              ■        ■\n");
                    gotoxy(10, 12);
                    printf("│    ■■■■■■■        ■  ■      ■                          ■  ■      ■\n");
                    gotoxy(10, 13);
                    printf("│                ■      ■      ■    ■      ■■■■■        ■      ■    ■\n");
                    gotoxy(10, 14);
                    printf("│    ■■■■■■■     ■        ■   ■    ■          ■      ■      ■    ■\n");
                    gotoxy(10, 15);
                    printf("│    ■                ■          ■  ■    ■          ■    ■          ■  ■\n");
                    gotoxy(10, 16);
                    printf("│    ■■■■■■■                    ■      ■■■■■                        \n");
                    gotoxy(10, 17);
                    printf("└────────────────────────────────────────────────────────────────────────────────┘");
                    for (int i = 6; i < 17; i++) {
                        gotoxy(91, i); printf("│");
                    }
                    printf("\n");
                    sideMin = 5;
                    sideMax = 13;
                    int stopNum = stopDraw();

                    //메뉴에 맞는 차트 보여주려고 식별함.
                    if (stopNum == 0) //선택한 코인에 맞는 변수 확인절차
                    {
                        //검은 글자에 흰 배경 - 클릭시 반짝임
                        setcolor(0, 7);
                        printf(" * 계 속 하 기");
                        setcolor(7, 0);
                        //계속하기에 맞는 코드 작성 부탁드립니다.
                        Sleep(200);
                    }
                    else if (stopNum == 1)
                    {
                        setcolor(0, 7);
                        printf(" * 다 시 하 기");
                        setcolor(7, 0);
                        //다시하기에 맞는 코드 작성 부탁드립니다.
                        Sleep(200);
                        system("cls");
                        return chart();
                    }
                    else if (stopNum == 2)
                    {
                        setcolor(0, 7);
                        printf(" * 메 인 으 로 ");
                        setcolor(7, 0);
                        //메인으로에 맞는 코드 작성 부탁드립니다.
                        Sleep(500);
                        return skipintro();
                        
                        
                    }
                   
                    else
                    {
                        printf("선택한 메뉴 : %d번 \n 해당 번호는 잘못 선택한겁니다.\n", stopNum);
                        //좌표 에러거나 오류 발생 시 맞는 코드 작성 부탁드립니다.
                        Sleep(2000);
                    }
                }
                else
                {
                    //checkbuy:
                        //putch(buy);
                    if (buy == 48 && buy_count == 0) {
                        // 돈복사 버그 수정위해 조건문에 구매횟수 를 걸어둠
                        //if (getch() == 13) {
                        gotoxy(25, 25);
                        printf("매입가 : %d", num[r][count - 1]);
                        coin_quantity += account / num[r][count - 1];
                        account = coin_quantity * num[r][count - 1];
                        purchase_amount = account;
                        purchase_price = num[r][count - 1];
                        buy_count++;
                        Beep(1100, 30);             //매수 효과음
                        Beep(1400, 30);
                        Beep(1500, 30);

                    }
                    else if (buy == 49 && buy_count >= 1) {  // 구매횟수가 없을 경우 구매하지 못함
                            //if (getch() == 13) {
                        gotoxy(25, 25);
                        printf("매도가 : %d", num[r][count - 1]);
                        account = coin_quantity * num[r][count - 1];
                        real_profit += account - purchase_amount;
                        purchase_price = 0.0;
                        coin_quantity = 0.0;
                        purchase_amount = 0.0;      //매입금액 초기화      
                        buy_count--;                //구매횟수 감소
                        Beep(1400, 30);             //매도 효과음
                        Beep(1100, 30);
                        Beep(1000, 30);

                    }
                }
            }
        }
        count++;

        //마지막에 들고있던 코인 강제청산된다 매수하고 안팔면 존버 불가!!! 무조건 20턴에 강제청산
        if (count == 20 && buy_count >= 1) {
            gotoxy(25, 25);
            printf("매도가 : %d", num[r][count - 1]);
            account = coin_quantity * num[r][count - 1];
            real_profit += account - purchase_amount;
            purchase_price = 0.0;
            coin_quantity = 0.0;
            purchase_amount = 0.0;      //매입금액 초기화      
            buy_count--;                //구매횟수 감소
            Beep(1400, 30);             //매도 효과음
            Beep(1100, 30);
            Beep(1000, 30);
        }
        //Sleep(500);
        if (count > 20)
            break;
        system("cls");
    }
    gotoxy(10, 33);
    printf("시드머니 : %.1f", fund);// 사용자 시작 금액

    gotoxy(10, 34);
    printf("총 보유자산 : %.3f", account); // 사용자의 최종 금액

    gotoxy(10, 35);
    printf("총 수익률 : %.3f%%", ((((1000 + real_profit) - 1000) / 1000) * 100));// 게임 끝나고 총수익률 출력
    for (int i = 0; i < 5; i++) {
        Beep(1400, 30);             //총수익률 나타낼때 효과음
        Beep(1100, 30);
        Beep(1000, 30);
    }
    printf("\n\n");
    
}

//콘솔 내부 좌표 이동 함수
void gotoxy(int x, int y)
{
    HANDLE consoleHandle = GetStdHandle(STD_OUTPUT_HANDLE); //콘솔 핸들 가져오기
    COORD pos;
    pos.X = x;
    pos.Y = y;
    SetConsoleCursorPosition(consoleHandle, pos);
}

// 커서 보이기 & 숨기기
void cursor(int n)
{
    HANDLE hConsole;
    CONSOLE_CURSOR_INFO ConsoleCursor;

    hConsole = GetStdHandle(STD_OUTPUT_HANDLE);

    ConsoleCursor.bVisible = n;
    ConsoleCursor.dwSize = 1;

    SetConsoleCursorInfo(hConsole, &ConsoleCursor);
}

//메인 메뉴 방향키 입력으로 '>' 위치 변경 
int menuDraw()
{
    while (1) { // 무한반복  
        int n = keyControl(); // 키보드 이벤트를 키값으로 받아오기  
        switch (n) {
        case UP: { // 입력된 키의 값이 UP인 경우 (위쪽 방향키) 
            Beep(1100, 50);     //메인화면 업 효과음
            Beep(1400, 50);
            if (my > menuMin)
            {
                gotoxy(mx - 2, my + 2);
                printf(" ");
                my = my - 2;
                gotoxy(mx - 2, my + 2);
                printf(">");
            }
            else
                my = menuMin;
            break;
        }

        case LEFT: { // 입력된 키의 값이 LEFT인 경우 (왼쪽 방향키) 
            if (my > menuMin)
            {
                gotoxy(mx - 2, my);
                printf(" ");
                my = my - 2;
                gotoxy(mx - 2, my);
                printf(">");
            }
            else
                my = menuMin;
            break;
        }


        case DOWN: { // 입력된 키의 값이 DOWN인 경우 (아래쪽 방향키) 
            Beep(1400, 50);     //메인화면 다운 효과음
            Beep(1100, 50);
            if (my < menuMax)
            {
                gotoxy(mx - 2, my + 2);
                printf(" ");
                my = my + 2;
                gotoxy(mx - 2, my + 2);
                printf(">");
            }
            else
                my = menuMax;
            break;
        }

        case RIGHT: { // 입력된 키의 값이 RIGHT인 경우 (오른쪽 방향키) 
            if (my < menuMax)
            {
                gotoxy(mx - 2, my);
                printf(" ");
                my = my + 2;
                gotoxy(mx - 2, my);
                printf(">");
            }
            else
                my = menuMax;
            break;
        }
        case SUBMIT: {
            Beep(1100, 30);         //엔터 효과음
            Beep(1400, 30);
            Beep(1100, 30);
            if (my >= menuMin && my <= menuMax)
                return (my - 16) / 2; // 엔터(선택)누를 경우 my-25
                // 시작 위치가 25임으로 (my-15)/2 를 하면 1(시작), 2(설정), 3(종료)의 숫자를 받음. 
            else
                break;
        }
        }
    }
}

//설정 방향키 입력으로 배경색, 글 색깔 변경
int settingDraw()
{
    while (1) { // 무한반복  
        int n = keyControl(); // 키보드 이벤트를 키값으로 받아오기  
        switch (n) {

        case LEFT: { // 입력된 키의 값이 LEFT인 경우 (왼쪽 방향키)        
            Beep(1100, 50);     //설정화면 왼쪽 효과음
            Beep(1400, 50);
            if (setx > 55)
            {

                gotoxy(59, 20);
                //ON 기본값, 검은 글자에 흰 배경
                setcolor(7, 0);
                printf(" OFF ");
                setx = setx - 6;
                gotoxy(54, 20);
                //OFF , 검은 글자에 흰 배경 --> 흰 글자에 검은 배경(콘솔 기본값)으로 되돌림
                setcolor(0, 7);
                printf(" ON ");
            }
            else
                setx = 55;
            break;
        }

        case RIGHT: { // 입력된 키의 값이 RIGHT인 경우 (오른쪽 방향키) 
            Beep(1100, 50);     //설정화면 오른쪽 효과음
            Beep(1400, 50);
            if (setx < 61)
            {

                gotoxy(54, 20);
                //OFF 기본값 , 검은 글자에 흰 배경 --> 흰 글자에 검은 배경(콘솔 기본값)으로 되돌림
                setcolor(7, 0);
                printf(" ON ");
                setx = setx + 6;
                gotoxy(59, 20);
                //ON , 검은 글자에 흰 배경
                setcolor(0, 7);
                printf(" OFF ");
            }
            else
                setx = 61;

            break;
        }
        case SUBMIT: {
            Beep(1100, 30);         //엔터 효과음
            Beep(1400, 30);
            Beep(1100, 30);
            if (setx >= 55 && setx <= 61)
                return (setx - 55) / 6; // 엔터(선택)누를 경우 setx-55
                // 시작 위치가 setx == 55임으로 (setx-55)/6 를 하면 0(ON), 1(OFF)의 숫자를 받음. 
            else
                break;

        }
        case ESC: {
            setcolor(7, 0);
            system("cls");
            startMain();
            graph();
            menuCoin();
            //return -1;
        }
        }
    }
}

//사이드 메뉴 방향키 입력으로 '>' 위치 변경 
int sideDraw()
{
    while (1) { // 무한반복  
        int n = keyControl(); // 키보드 이벤트를 키값으로 받아오기  
        switch (n) {
        case UP: { // 입력된 키의 값이 UP인 경우 (위쪽 방향키) 
            Beep(1100, 50);         //효과음
            Beep(1400, 50);
            if (my > sideMin)
            {
                gotoxy(mx - 2, my);
                printf(" ");
                my = my - 2;
                gotoxy(mx - 2, my);
                printf(">");
            }
            else
                my = sideMin;
            break;
        }

        case LEFT: { // 입력된 키의 값이 LEFT인 경우 (왼쪽 방향키) 
            if (my > sideMin)
            {
                gotoxy(mx - 2, my);
                printf(" ");
                my = my - 2;
                gotoxy(mx - 2, my);
                printf(">");
            }
            else
                my = sideMin;
            break;
        }


        case DOWN: { // 입력된 키의 값이 DOWN인 경우 (아래쪽 방향키) 
            Beep(1100, 50);         //효과음
            Beep(1400, 50);
            if (my < sideMax)
            {
                gotoxy(mx - 2, my);
                printf(" ");
                my = my + 2;
                gotoxy(mx - 2, my);
                printf(">");
            }
            else
                my = sideMax;
            break;
        }

        case RIGHT: { // 입력된 키의 값이 RIGHT인 경우 (오른쪽 방향키) 
            if (my < sideMax)
            {
                gotoxy(mx - 2, my);
                printf(" ");
                my = my + 2;
                gotoxy(mx - 2, my);
                printf(">");
            }
            else
                my = sideMax;
            break;
        }
        case SUBMIT: {
            Beep(1100, 30);         //엔터 효과음
            Beep(1400, 30);
            Beep(1100, 30);


            if (my >= sideMin && my <= sideMax)
                return (my - sideMin) / 2; // 엔터(선택)누를 경우 my-sideMin
            // 1번 시작 위치 = sideMin
            // 선택한 좌표 my
            // (my-sideMin)/2 를 하면 0, 1, 2, 3, 4의 숫자를 받음. 
            else
                break;
        }
        }
    }
}

//사이드 메뉴 방향키 입력으로 '>' 위치 변경 
//사이드 메뉴 방향키 입력으로 '>' 위치 변경 
int stopDraw()
{
    while (1) { // 무한반복  
        int n = keyControl(); // 키보드 이벤트를 키값으로 받아오기  
        switch (n) {
        case UP: { // 입력된 키의 값이 UP인 경우 (위쪽 방향키) 
            Beep(1100, 50);         //효과음
            Beep(1400, 50);
            if (my > sideMin)
            {
                gotoxy(mx - 2, my);
                printf(" ");
                my = my - 2;
                gotoxy(mx - 2, my);
                printf(">");
            }
            else
                my = sideMin;
            break;
        }

        case LEFT: { // 입력된 키의 값이 LEFT인 경우 (왼쪽 방향키) 
            if (my > sideMin)
            {
                gotoxy(mx - 2, my);
                printf(" ");
                my = my - 2;
                gotoxy(mx - 2, my);
                printf(">");
            }
            else
                my = sideMin;
            break;
        }


        case DOWN: { // 입력된 키의 값이 DOWN인 경우 (아래쪽 방향키) 
            Beep(1100, 50);         //효과음
            Beep(1400, 50);
            if (my < sideMax-4)
            {
                gotoxy(mx - 2, my);
                printf(" ");
                my = my + 2;
                gotoxy(mx - 2, my);
                printf(">");
            }
            else
                my = sideMax-4;
            break;
        }

        case RIGHT: { // 입력된 키의 값이 RIGHT인 경우 (오른쪽 방향키) 
            if (my < sideMax)
            {
                gotoxy(mx - 2, my);
                printf(" ");
                my = my + 2;
                gotoxy(mx - 2, my);
                printf(">");
            }
            else
                my = sideMax;
            break;
        }
        case SUBMIT: {
            Beep(1100, 30);         //엔터 효과음
            Beep(1400, 30);
            Beep(1100, 30);


            if (my >= sideMin && my <= sideMax)
                return (my - sideMin) / 2; // 엔터(선택)누를 경우 my-sideMin
            // 1번 시작 위치 = sideMin
            // 선택한 좌표 my
            // (my-sideMin)/2 를 하면 0, 1, 2, 3, 4의 숫자를 받음. 
            else
                break;
        }
        }
    }
}

//getch 를 이용한 키보드 방향키 입력
int keyControl()
{
    int temp = _getch();
    if (temp == 72) //방향키 ↑ 입력
        return UP;
    else if (temp == 80)//방향키 ↓ 입력
        return DOWN;
    else if (temp == 75)//방향키 ← 입력
        return LEFT;
    else if (temp == 77)//방향키 → 입력
        return RIGHT;
    else if (temp == 13)//엔터 키 입력
        return SUBMIT;
    else if (temp == 27)//ESC 키 입력
        return ESC;
}

//콘솔 글씨 색깔, 백그라운드 색깔 변경 ( 쓰기 편하라고 만듦 )
void setcolor(unsigned short text, unsigned short back)
{
    SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), text | (back << 4));
}

// 지금의 x 좌표를 조사
int wherex()
{
    CONSOLE_SCREEN_BUFFER_INFO BufInfo;



    GetConsoleScreenBufferInfo(GetStdHandle(STD_OUTPUT_HANDLE), &BufInfo);
    return BufInfo.dwCursorPosition.X;
}

// 지금의 y좌표를 조사 
int wherey()
{
    CONSOLE_SCREEN_BUFFER_INFO BufInfo;



    GetConsoleScreenBufferInfo(GetStdHandle(STD_OUTPUT_HANDLE), &BufInfo);
    return BufInfo.dwCursorPosition.Y;
}

void graph() {      //시작 인터페이스에만 사용할 그래프
    int i, j, x = 30, buy, y = 26, cnt, color, num[30];

    int color_ran;  //색 변수


    for (int i = 0; i < 30; i++) {
        num[i] = (rand() % 20 + 1);
    }
    ;
    color_ran = rand() % (36 - 31 + 1) + 31;

    for (i = 0; i < x; i++) //x는 x축 20줄만 뽑을 예정
    {
        if (num[i] > y)   // y는 y축의 최대치를 결정한다
            y = num[i];
        if (num[i] == 0)
            break;
    }
    cnt = i;

    for (i = 0; i < y; i++)  //y축 숫자표시
    {

        for (j = 0; j < cnt; j++) // 막대 그래프 한줄씩 출력
                                // 주의 ! 세로기준이 아니라 배열 값에따라 위에서 부터 내려옴
            if (y - i <= num[j]) {
                color_ran = rand() % (36 - 31 + 1) + 31;
                printf("\x1b[%dm" "l■l" "\x1b[0m", color_ran);
            }
            else
                printf("    ");

    }
}

void ranking()
{
    DATA Input[MAX_INPUT] = { 0 };
    FILE* fp = NULL;
    int  i = 0;
    //< 파일에서 데이터 얻어오기 
    fp = fopen_s(&fp, "Rank.txt", "r");
    if (fp == NULL)
    {
        printf("파일 열기 실패\n");
        return 0;
    }
    //< 데이터 파일에서 읽기 
    while (fscanf_s(&fp, "%d%s", &Input[i].nStage, Input[i].szName) != EOF)
    {
        i++;
    }
    //< 소팅 
    RankSort(Input, i);
    //< 출력 
    Print(Input, MAX_INPUT);
    fclose(fp);
}
//< 정렬
void RankSort(DATA* pData, int nSize)
{
    int i, j;

    int nFlag = 0;
    //< 정렬
    for (i = 0; i < nSize - 1; i++)
    {
        nFlag = 0;
        for (j = 0; j < nSize - 1 - i; j++)
        {
            if (pData[j].nStage < pData[j + 1].nStage)
            {
                SwapData(&pData[j], &pData[j + 1]);
                nFlag = 1;
            }
        }
        if (nFlag == 0)
        {
            break;
        }
    }
}
//< 데이터 출력
void Print(DATA* pData, int nSize)
{
    FILE* fp = NULL;
    int i = 0;

    fp = fopen_s(&fp, "Rank.txt", "w");

    if (fp == NULL)
    {
        printf("파일 저장 실패\n");
        return;
    }

    fputs("----------------------------------\n", fp);
    fputs("------------- 순위----------------\n", fp);
    for (i = 0; i < nSize; i++)
    {
        fprintf(fp, "%d", i + 1);
        if (pData[i].nStage != 0)
        {
            fprintf(fp, "------%2d Stage\t%s\n", pData[i].nStage, pData[i].szName);
        }
        else
        {
            fprintf(fp, "---------------------------\n");
        }
    }
    fputs("----------------------------------", fp);
}
//< 데이터 바꾸기 
void SwapData(DATA* pLeft, DATA* pRight)
{
    DATA sTemp;
    memmove(&sTemp, pLeft, sizeof(DATA));
    memmove(pLeft, pRight, sizeof(DATA));
    memmove(pRight, &sTemp, sizeof(DATA));
}

void intro() {
    for (int i = 0; i < 17; i++) {   //시작 인터페이스 그래프 띄우기 i < 10  수정 하면 그래프 뜨는 횟수 바뀜
        startMain();
        graph();
        Sleep(240);
    }
    menuCoin();
    maincount++;
}
void skipintro() {
    system("cls");
    startMain();
    graph();
    Sleep(240);
    menuCoin();
    maincount++;
}





